
-- phpMyAdmin SQL Dump
-- version 3.5.2.2
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Янв 14 2016 г., 12:41
-- Версия сервера: 10.0.20-MariaDB
-- Версия PHP: 5.2.17

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `u860732805_cafe`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categorys`
--

CREATE TABLE IF NOT EXISTS `categorys` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `img` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=6 ;

--
-- Дамп данных таблицы `categorys`
--

INSERT INTO `categorys` (`id`, `title`, `img`, `created_at`, `updated_at`) VALUES
(1, 'Печиво без глютену', '/img/IMG_20141230_220621.jpg', '2015-11-27 09:26:11', '2016-01-13 10:26:11'),
(2, 'печиво без казеїну', '/img/Gpb3xX5uTc0.jpg', '2015-11-27 09:26:36', '2016-01-13 10:26:58'),
(5, 'млинці гречані (без глютену)', '/img/mlinc-z-grechanogo-boroshna-recepti-prigotuvannya-z-foto_144.jpeg', '2016-01-13 10:46:43', '2016-01-13 10:46:43'),
(4, 'Хлібці', '/img/хлібці дар сходу.jpg', '2015-12-26 18:49:25', '2015-12-26 18:49:25');

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE IF NOT EXISTS `migrations` (
  `migration` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`migration`, `batch`) VALUES
('2014_10_12_000000_create_users_table', 1),
('2014_10_12_100000_create_password_resets_table', 1),
('2015_11_26_122323_tovars', 1),
('2015_11_27_101727_categorys', 1),
('2015_12_03_172242_orders', 2),
('2015_12_15_173435_recipes', 3),
('2015_12_16_120758_orders_column_add', 4);

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE IF NOT EXISTS `orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `order_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `amount` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `address` text COLLATE utf8_unicode_ci NOT NULL,
  `phone` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `city` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `time1` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `time2` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=77 ;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `order_id`, `item_id`, `price`, `amount`, `name`, `address`, `phone`, `created_at`, `updated_at`, `city`, `time1`, `time2`) VALUES
(73, 56, 13, '129.00', 1, 'Віталій', 'червоної калини 115', '063999999', '2015-12-16 10:17:17', '2015-12-16 10:17:17', 'Львів', '23:09', '23:59'),
(74, 57, 5, '50.10', 1, '123', '213123', '232323', '2015-12-16 10:20:51', '2015-12-16 10:20:51', 'Львів', '232', '32323'),
(75, 58, 13, '129.00', 5, 'Віталій', 'пр.Червоної Калини 115', '0937277385', '2015-12-16 17:07:03', '2015-12-16 17:07:03', 'Львів', '18:43:00', '23:58:00'),
(76, 59, 5, '50.10', 3, 'Поліна Тищенко', 'Піскова 2 кв 5', '0636814247', '2015-12-16 20:03:22', '2015-12-16 20:03:22', 'Львів', '12:30', '13:40');

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  KEY `password_resets_email_index` (`email`),
  KEY `password_resets_token_index` (`token`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `recipes`
--

CREATE TABLE IF NOT EXISTS `recipes` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `head` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `preview` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `recipes`
--

INSERT INTO `recipes` (`id`, `title`, `head`, `description`, `preview`, `created_at`, `updated_at`) VALUES
(1, 'Новорічний', 'Новогодний салат из курицы, грибов, авокадо, зелени и помидоров черри. Это вкусное и несложное в приготовлении блюдо к празднику.', '1. Приготовить запеченное куриное филе. Нарезать тонкими ломтиками.\r\n\r\n2. Авокадо почистить, удалить косточку. Тонко нарезать мякоть и сбрызнуть ее лимонным соком.\r\n\r\n3. Грибы нарезать пластинками и обжарить на растительном масле. Посолить и поперчить.\r\n\r\n4. Зелень и помидоры черри помыть.\r\n\r\n5. Застелить тарелку салатными листьями. Сверху выложить курицу, авокадо, грибы и помидоры. \r\n\r\n6. Полить оливковым маслом, посолить и поперчить. Сбрызнуть салат бальзамическим уксусом и посыпать кунжутом.', '/img/novorichnyj.jpg', '2015-12-15 15:54:16', '2015-12-15 15:54:16'),
(2, 'День Святого Николая: ТОП-3 рецепта печенья к празднику', 'В День Святого Миколая - 19 грудня', 'Приготовь своему ребенку вкусные сладости ко Дню Святого Николая. А вот и рецепты):\r\n\r\n1. Николайчики \r\n\r\nЧитай также:\r\nЧто подарить ребенку на день святого Николая\r\nДля приготовления праздничной выпечки понадобится: 600 г муки, 150 г маргарина, 2 яйца и два желтка, 200 г сахара, 150 мл жидкого меда, ½ ч. ложки корицы и гвоздики, 1 ч. ложка соды, 2 ст. ложки сметаны\r\n\r\nДля глазури: 1 яичный белок, 1 стакан сахарной пудры, ½ чайной ложки лимонного сока, сок свеклы, шпината – если хочешь сделать глазурь цветной\r\n\r\nПриготовление рождественской выпечки: Перед началом работы сделать из картона шаблон фигурки Николайчика. Муку просеять, всыпать соду, добавить натертый на крупной терке маргарин, все вместе порубить ножом. Добавить яйца, желтки, сметану, сахар, специи и мед, замесить тесто и оставить в морозилке на ночь.\r\n\r\nРаскатать охлажденное тесто до толщины в пол сантиметра, приложить шаблоны и вырезать фигурки. Выложить фигурки на смазанный маслом и присыпанный мукой противень. Выпекать при 180 градусах до золотистого цвета. Готовые пряники охладить и покрыть глазурью. Для приготовления глазури взбить яичный белок в крутую пену, постепенно добавляя сахарную пудру и лимонный сок. Можно добавить сок свеклы, моркови или шпината, тогда глазурь будет цветной.\r\n\r\n2. Имбирные звездочки \r\n\r\nЧитай также:\r\nРождественский пудинг: Символ старой Англии\r\nДля приготовления праздничной выпечки понадобится: 500 г муки, 1 ч. ложка порошка для выпечки, 1 ч. ложка соды, 3 ч. ложки молотого имбиря, 1/2 ч. ложки кардамона, щепотка соли, 150 г несоленого сливочного масла, размягченного, 175 г коричневого сахара, 150 мл меда, 1 яйцо, сахарная пудра для посыпки\r\n\r\nПриготовление выпечки: Разогреть духовку до 180◦С. Просеять муку, добавить порошок для выпечки, соду, специи и щепотку соли. Миксером взбить масло и коричневый сахар. Добавить мед и яйцо. Смешивать до однородного состояния.\r\n\r\nСоединить мучную смесь с масляной на низкой скорости миксера. Разделить тесто пополам. Обернуть в пищевую пленку,  поместить в холодильник на 30 минут. Вырезать шаблоны звезд из картона. Раскатать тесто в пласт толщиной 4 мм.  Вырезать звезды.\r\n\r\nРазложить звезды на бумагу для выпечки на противне. Выпекать большие звезды 8-10 минут, маленькие звезды – 5-7 минут или до глубокого золотого цвета. Охладить выпечку. Подавать рождественскую выпечку, посыпав ее сахарной пудрой.\r\n\r\n3. Миндальные пряники на елку \r\n\r\nЧитай также:\r\nАнглийский пудинг от Джейми Оливера\r\n Для приготовления праздничной выпечки понадобится: 250 г муки, 4 яйца, 200 г молотого миндаля, 200 г сахара, 10 г ванильного сахара, 1 ч. ложка разрыхлителя, 1 ч. ложка корицы, гвоздика, кардамон – на кончике ножа, 50 г апельсиновых цукатов, 80 г лимонных цукатов, цедра половины лимона, сахарный сироп\r\n\r\nДля глазури: 200 г сахарной пудры, 2 ст. ложки лимонного сока, 2 ст. ложки кипятка\r\n\r\nПриготовление пряников: Взбить яйца с сахаром и ванилью. Добавить миндаль, мелко покрошенные цукаты, цедру лимона и специи, все тщательно перемешать.\r\n\r\nДобавить смешанную с разрыхлителем муку. Замесить крутое тесто, сформировать небольшие шарики и выложить их на противень, застеленный пергаментной бумагой.\r\n\r\nВыпекать пряники 15-20 минут при температуре 180◦С.\r\n\r\nПриготовить глазурь: смешать сахарную пудру, лимонный сок, кипяток. Перемешивать 5 минут. Покрыть миндальные пряники глазурью.', '/img/nikolai.jpg', '2015-12-15 16:34:59', '2016-01-05 12:36:43'),
(3, 'Салат з рибою і виноградом', 'Рибний салат з тунцем і виноградом має вишуканий і незвичайний смак. ', 'Поріжте консервований тунець великими скибками. Цибулю почистіть, помийте і наріжте тонкою соломкою. Кожну виноградинку розріжте навпіл. Капусту помийте і поріжте великими шматками.\r\nВсі інгредієнти (тунець, цибуля, капусту, виноград) покладіть в миску і перемішайте. Додайте білий мелений перець, сіль, цукор, заправте салат оцтом і оливковою олією.\r\nСалат можна прикрасити зверху виноградом, як показано на малюнку.\r\nПриємного апетиту!\r\nПоради:\r\n- Спробуйте додати в готовий салат з тунцем і виноградом подрібнені фісташки або волоські горіхи.\r\n- Насипте в салат ваші улюблені приправи для гостроти: чорний мелений або червоний мелений перець. Можете додати подрібнений хрін.\r\n- Замість оливкової олії, салат можна приправити майонезом, проте це набагато більш калорійний варіант.\r\n', '/img/4067ef.jpg', '2016-01-05 12:33:37', '2016-01-05 12:33:37');

-- --------------------------------------------------------

--
-- Структура таблицы `tovars`
--

CREATE TABLE IF NOT EXISTS `tovars` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `description` text COLLATE utf8_unicode_ci NOT NULL,
  `preview` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `category` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=24 ;

--
-- Дамп данных таблицы `tovars`
--

INSERT INTO `tovars` (`id`, `title`, `description`, `preview`, `price`, `category`, `created_at`, `updated_at`) VALUES
(5, 'Бізе ведмедик', 'Смаковите бізе в формі різних тварин', '/img/HrFFkUB6RP4.jpg', '50.10', 2, '2015-11-27 10:03:43', '2015-11-27 11:02:38'),
(16, 'панкейк "трилобіт"', 'В основу входить гречане борошно та сухофрукти: родзинки, курага, фініки, вишня...', '/img/6547.JPG', '150.00', 1, '2015-12-26 12:57:03', '2015-12-26 12:57:03'),
(18, 'Житні хлібці з нутом', '4 ст. (доверху) пророщенной ржи\r\n170 г семян льна (70 г льна заранее высыпать в стакан, налить почти доверху воды, оставить разбухать на несколько часов)\r\n1.5 ч. л. морской соли средней\r\n1 ч. л. кориандра\r\n1/3 ч. л. сухого базилика\r\n1/3 ч. л. корицы', '/img/Ржаной-хлеб-с-нутом1.jpg', '30.00', 4, '2015-12-26 18:58:28', '2015-12-26 18:58:28'),
(15, 'тортик з фруктів', 'З усіма потрібними вітамінами без казеїну та глютену, на вівсяному борошні', '/img/1373487289_Recept-Fruktovyiy-tort-An.jpg', '200.00', 1, '2015-12-26 12:53:45', '2015-12-26 12:53:45'),
(19, 'Вівсяні хлібці з гарбузовим насінням', 'около 300 г голозерного овса (промыть, прорастить)\r\n5-6 стеблей сельдерея\r\n2 ч. л. черной соли\r\n1 небольшой банан\r\n120 г очищенных тыквенных семечек (промыть, ненадолго замочить)\r\n100 г льна, смолотого в кофесолке в муку\r\n2 щепотки розмарина\r\n1 ст. л. кунжутного масла', '/img/Овсяный-хлеб.jpg', '35.00', 4, '2015-12-26 19:18:01', '2015-12-26 19:18:01'),
(21, 'М''які соняшникові "монетки" з морквою та цибулею', '\r\nОтлично идет как сытный перекус где-нибудь в дороге :-)\r\n\r\n500-530 г очищенного (промытого и предварительно замоченного) подсолнечного семени\r\n150 г белого кунжута (предварительно замочить на ночь — сделать это обязательно, иначе, если насыпать в тесто незамоченный кунжут, готовые “монетки” будут горчить”! — затем с утра воду слить, семена хорошенько промыть)\r\n190-200 г мелко тертой моркови\r\n220-230 г листьев пекинской капусты\r\n1-1.5 ч. л. морской соли\r\n1 ч. л. сухого базилика\r\n1/2-1 ч. л. розмарина\r\n1 пучок зеленого лука\r\n\r\n', '/img/MG_1990.jpg', '20.00', 4, '2015-12-26 19:30:40', '2015-12-26 19:30:40'),
(22, 'Печиво "Персик"', 'Яка різниця, що на вулиці зовсім не та пора року?! Я хочу песики їсти як літом!', '/img/ijv4rfb8553915f1a2544999604209.jpg', '35.00', 1, '2015-12-26 19:37:59', '2015-12-26 19:37:59'),
(23, 'Страва в розіграші ', 'Кожного тижня розігрується страва на 50% дешевше (Якість на ціну не впливає)', '/img/1926716_852048791477134_8999194365529401103_n.jpg', '120.00', 4, '2015-12-26 19:43:56', '2015-12-26 19:43:56');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(60) COLLATE utf8_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=4 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(3, 'odmin', '', '$2y$10$C/n8WqGv1/3YwQ0/hdBL4OV7qBJ9bfnFlWUvRz7w1WctQ90w1t/re', 'foWPLnLTXpWHc33xGQhHcoFXhR8HFMNEDwCaG8s3b7yylwTLgCEbXzqWkHwW', '2016-01-04 13:11:19', '2016-01-11 18:57:27');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
